triflicacid/remote-submersible/stm32cubemx/off-board/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2024 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32l4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define B1_Pin GPIO_PIN_13
#define B1_GPIO_Port GPIOC
#define B1_EXTI_IRQn EXTI15_10_IRQn
#define LD2_Pin GPIO_PIN_5
#define LD2_GPIO_Port GPIOA
#define SSD_SELECT_Pin GPIO_PIN_0
#define SSD_SELECT_GPIO_Port GPIOB
#define TRISTATE_UP_Pin GPIO_PIN_6
#define TRISTATE_UP_GPIO_Port GPIOC
#define TRISTATE_UP_EXTI_IRQn EXTI9_5_IRQn
#define TRISTATE_DOWN_Pin GPIO_PIN_7
#define TRISTATE_DOWN_GPIO_Port GPIOC
#define TRISTATE_DOWN_EXTI_IRQn EXTI9_5_IRQn
#define RFM_DIO0_Pin GPIO_PIN_8
#define RFM_DIO0_GPIO_Port GPIOA
#define RFM_DIO0_EXTI_IRQn EXTI9_5_IRQn
#define RFM_RESET_Pin GPIO_PIN_9
#define RFM_RESET_GPIO_Port GPIOA
#define RFM_SELECT_Pin GPIO_PIN_10
#define RFM_SELECT_GPIO_Port GPIOA
#define BTN_RELEASE_POD_Pin GPIO_PIN_10
#define BTN_RELEASE_POD_GPIO_Port GPIOC
#define BTN_RELEASE_POD_EXTI_IRQn EXTI15_10_IRQn
#define BTN_REQ_CODE_Pin GPIO_PIN_11
#define BTN_REQ_CODE_GPIO_Port GPIOC
#define BTN_REQ_CODE_EXTI_IRQn EXTI15_10_IRQn
#define BTN_SEND_CODE_Pin GPIO_PIN_12
#define BTN_SEND_CODE_GPIO_Port GPIOC
#define BTN_SEND_CODE_EXTI_IRQn EXTI15_10_IRQn

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
